#### FOR LooP ####
#لها عدة استخدامات والاكثر استعمالا عندما يتعلق الامر بالتكرارات والاسرع . 
##FOR LOOP WITh LIST##
x=[1,2,3,4]
for i in x:print(i)
# هنا بقوله لكل عنصر  ف الليسته اطبع لى العنصر ف بيطبع كل عنصر فى سطر . 
print("--------")
for i in x:
     if i==3:break
     print(i)
#هنا قولتله الما توصل للعنصر 3 ما تجيبوش واخرج من اللوب .
print("--------")
for i in x:
    if i==3:continue
    print(i)
#هنا بقوله لما تلاقى الرقم 3 سيبه و كمل اللوب للاخر . 
print("=========================")

class loop:
        x=[1,2,3,4,5]
        y=[2,2,2,2,2]
        
f=loop()
print(f.x)        
        
print(loop.y)        
print(loop.x)        
        
        
        