#we will speak about string and some of it functions

x="hello python*hello world*hellO python*hello world"

x_1=x.split()     ;print("%%%%%1%%%%% \n",x_1) 
# .*.لو سيبت القوسين فاضيين هايقسم على اساس المسافه ف كل مسافه ها يشوفها ها يعتبر ال قبليها عنصر وال بعديها عنصر وسيتم التقسيم على هذا الاساس ولكن اذا اردت ان تقسم على اساس اخر وليكن على سبيل المثال القادم هو رمز ال 

x_2=x.split("*") ;print("%%%%%2%%%%% \n",x_2)
#  ها تعملها كده ز اياً يكن الشئ ال انت عاوز تقسم على اساسه ها تحطوا بين الدبل كوتيشن دول " " بس 

x_3=x.split("*",2) ;print("%%%%%3%%%%% \n",x_3)
# دى بتعملها وبتعدل ف الرقم براحتك ومعناا انك بتقسم على اساس "*" ولكن اول "*" بس واى "*" تيجي بعدها مش ها يشوفها خالص ولو عاوز على اساس اول 2 من دى "*" بتغير الرقم ل 2 وهكذا للاخر . بس

#===========================================================================================================================================================================================================================================================

# نشوف بقا ()x.splitlines .
#ودى بتستخدمها لو النص بتاعك مكتوب على عدة سطور وانت عاوز تمسك كل سطر لوحده وتشتغل عليه ف بتقسم بالداله دى وبيعامل كل سطر على انو عنصر .
z="""hello world
hello python
hello world
hello python"""

z_1=z.splitlines();print("%%%%%4%%%%% \n",z_1)
#زى ما شوفت خلى كل سطر عنصر واحد .
# ملاحظات على دالتى split &splitlinesبيتم تخزين العناصر الخارجه عن تلك الدوال فى list 
# يتم حذف العنصر الذى يتم التقسيم على اساسه ولا يدرج فى ال list المكونه (عكس داله partion الذى سنأخذها الان )

#===========================================================================================================================================================================================================================================================
print("%%%%%parttion%%%%%")
p="hello==python==hello==world"

p_1=p.partition("==");print(p_1)
#ودى بتستخدمها علشان تقسم بردوا لكن فى بينها وبين اسبليت بعض الاختلافات منها ان دى بتحط الشئ ال انت بتقسم على اساسه كعنصر من عناصر القايمه ولا يتم حذفه كما تفعل اسبليت . ,.
#لاحظ عمل الداله هذه انها تقسم النص لثلاث قطع الاجزء قبل المعطى ف القوسين والمعطى فى القوسين والجزء بعد المعطى فى القوسين وكما نلاحظ يبدأ البحث عن المعطى فى القوسين من اليسار 


#لكن اذا اردت ان تبحث من اليمين تستخد دالة rpartition 

p_2=p.rpartition("==");print(p_2)

#============================================================================================================================================================================================================================================================
print("%%%%%find%%%%%")
q="hello world"

q_1=q.find("h") ; print(q_1) 
#هذه الداله تبحث عن العنصر المعطى داخل الاقواس فى النص اذا وجدته بتعطيك رقم الانديكس الخاص به واذا ما وجدته بتعطيك -1 . 

q_2=q.index("w");print(q_2) 
#هذه اختلافها من الداله السابقه انها اذا ما وجدت العنصر بتعطيك خطأ 

#============================================================================================================================================================================================================================================================
print("%%%%%replace%%%%%")
w="hello python"

w_1=w.replace("python" ,"world") ;print(w_1)
#تقوم تلك الداله باستبدال الجزء الاول بالجزء الثانى فى النص 
w_2=w.replace('l','yy',2);print("%%%%%1%%%%%",w_2)
w_3=w.replace('l','yy',1);print("%%%%%2%%%%%",w_3)
w_4=w.replace('l','yy',0);print("%%%%%23%%%%%",w_4)

#============================================================================================================================================================================================================================================================
print("%%%%%count%%%%%")
e="hello world"

e_1=e.count("l");print(e_1)
#بتستخد الداله دى علشان تعرف عدد تكرار جزء او حاجه معينه فى النص 

#============================================================================================================================================================================================================================================================

o="hElLO wORLD"#لاحظ شكل الحروف بالنص هذا 

o_1=o.capitalize();print("%%%1%%%",o_1)
#الداله دى كل ال بتعمله انها بتكبر الحرف ال ف اول النص فقط وترجع بقية الحروف ف الانص ال حروف صغيره . 

o_2=o.title();print("%%%2%%%",o_2)
#دى بقى بتعمل شغل زياده عن الفايته بانها بتخلى اول حرف ف كل جمله كبير وبقيه حروف كل جمله صغيرة وبتعرف الجمله الجديده بان قبلها سبيس .

o_3=o.upper();print("%%%3%%%",o_3)
#دى بتخلى كل حروف النص كبيرة .

o_4=o.swapcase();print("%%%4%%%",o_4)#لاحظ اناول حرف ف كل جمله صغير و البقاى كل كبير 
#دى بقا بتعكس حاله الحرف لو كبير يبقى صغير والعكس .

#====================================================

#####دول بقا بعض الدوال ال بتسأل وبتتأكد بيها من شويه حاجات ف النص بتاعك 

i="HELLO PYTHON" #لاحظ كل النص حروفه كبيره 

i_1=i.isalpha();print(i_1)
#دى بتسال هل كل النص بتاعك حروف ولا فيه ارقام ورموز ومسافات وعلشان فى هنا مسافه النتيجه ها تكون خطأ (فولس)

i_2=i.isdigit();print(i_2)
# بتسأل  هل النص بتاعك كله ارقام او لا وعلشان هنا حروف ف النتيجه كانت خطأ (فولس)

i_3=i.isupper();print(i_3)
#دى بقا بتسأل هل كل حروف النص كبيره او صغيره وعلشان نصنا حروفه كبيره هتكون النتيجه صح (ترو)

i_4=i.islower();print(i_4)
#دى عكس الفايته د بتسأل هل كله صغير وعلشان النص بتاعنا كان حروفه كبيره هتكون النتيجه خطأ (فولس)

i_5=i.istitle();print(i_5)
#ودى نتيجتها خطأ (فولس) علشان كل الحروف كانت كبيره مش الحروف الاولى من الجمله بس .

i_6=i.startswith("HELLO");print(i_6)
#دى بتسأل هل النص بيبدأ بالكلمه دى ولا لا وبيرجع ترو او فولس 

i_7=i.endswith("python");print(i_7)#لاحظ ان انا حاطط الكلمه سمول والمفروض تكون كابيتال 
# ودى على عكس الفايته دى بتسأل ها الكلام بينتهى بالكلمة دى او لا وبيرجع ترو و فولس بردو 


#============================================================================================================================================================================================================================================================ 

r="hello world"#لاحظ انها تحتوى 11 حرف (المسافه بتتحسب حرف )تمم 

r_1=r.center(20,'$');print(r_1)
#بالداله دى تقدر توسطن الكلام بين اى حاجه بحيث يكون الرقم ال انت حاطه بيشمل الحاجه ال انت ها توسطن بينها وعدد حروف النص معا وف الجنب التانى بتحط الحاجه ال انت عاوز تحطها على يمين وشمال النص ولو سبتها فاضيه بيحط سبيسس (مسافات ) 

r_11=r.center(20);print(r_11)

r_2=r.ljust(20,'-');print(r_2)
#دى بقا بتحط الحاجه ال انت عاوزها على يمين النص بس 

r_3=r.rjust(20,'-');print(r_3)
#دى بقا علشان لو عاوز تحط على الشمال بس 

#دى حاجه كده بتحط اصفار على شمال النص وغالبا ما تستخدم مع الارقام وبتحط فيها رقم الwidth بس 
r_4=r.zfill(20);print(r_4)
print("len is ",len(r_4))

#============================================================================================================================================================================================================================================================ 
print("%%%%%strip%%%%%")
t="   hello python   "#لاحظ وجود بعض المسافات قبل وبد النص 

t_1=t.strip();print(t_1)
# بتلك الداله تسطيع مسح اى مسافات او رموز على طرفى النص 
t11="===hello python==="#لاحظ وجودبعض الرموز على يمين ويسار النص

t_111=t11.strip('=');print(t_111)
#يتم وضع الرمز المراد حذفه بين قوسين الداله 

t_2=t.rstrip();print(t_2)
#الداله دى بقى بتحذف من على يمين النص بس 
t_22="===hello python==="
t_222=t_22.rstrip('=');print(t_222)

t_3=t.lstrip();print(t_3)
# الداله دى بقى علشان لو عاوز تحذف من على يسار النص 
t_33="===hello python==="
t_333=t_33.lstrip('=');print(t_333)

#============================================================================================================================================================================================================================================================
print("%%%%tricks%%%%")
#بعض التركات ال ممكن تستخدمها ف النص 


#  \n  ودى بتستخدمها علشان تنزل سطر 

u="hello \npython";print(u)


# \t  ودى بتستخدها علشان تحط تاب  (ال هى اربع مسافات ) فى اى نص 

a="hello\tpython";print(a)


#============================================================================================================================================================================================================================================================
###FORMATING###

m=input("YOU PLAY : ")
m1=input("YOU PLAY : ")
# #دى بتخذن فبها القيم وانصح بوضع 1 ف الاولى و 2 ف التانيه علشان تعرف تفهم عمل ال 0 وال 1 ال تحت دول 
print("""I'M PLAYING {} AND {}""".format(m,m1))
print("""I'M PLAYING {0} AND {1}""".format(m,m1))
print("""I'M PLAYING {1} AND {0}""".format(m,m1))
# #الارقام دى معناها ترتيب المدخلات مش اكتر .

mm='*'+'{:^20}'.format("hello")+'*'
print(mm)
# #دى تركايه كده بالفورمات بتوسطن بيها الكلام.

#============================================================================================================================================================================================================================================================



for e in range(100000):
    e=(input("ENTER NUMBER ' 0 ' IF YOU WANT QUIT OR PREES ENTER : "))
    if e=='0':
        break

