###RANDOM LIBARY###

import random as rn

a=rn.random()
#دى بتجيب رقم عشوائي بين الصفر وال واحد بيكون فلوت 

print(round(a*10,4))
print(a*10)#دى معناها الرقم ها يكون من 1 ل 10
print(a*100)##دى معناها من 1ل 100
#لكن الارقام هاتكون فلوت 
print("-------------------")
#وممكن تستخدم دى علشان تجيب رقم فلوت بين فتره معينه 
aa=rn.uniform(50,100);print(aa )
print("-------------------")
#طب لو عاوز رقم صحيح بتستخدم دى 
b=rn.randint(100,200)
print(b)#دى بتختار البدايه والنهايه 
bb=rn.randrange(50,100,2)
print(bb)#دى بتاخد البدايه والنهايه والخطوه 
print("-------------------")
#اما لو عاوز يختار عشوئي بتشتغل بالداله دى .
c=[1,2,3,4,5,6,7,8,9,10]
cc=rn.choice(c);print(cc)
#دى بيختار رقم من ارقام الليسته
c_1="hello"
cc_1=rn.choice(c_1);print(cc_1)
#دى بيختار حرف من حروف النص ال اديتهوله
print("-------------------")
#دى بقا لو عاوز تختار عدد من العناصر العشوائيه مش رقم واحد وبيخزنهم فى ليسته .
d=rn.sample(range(201),20);print(d)
print("-------------------")
#لو عندك ليسته معينه عاوز تغير ترتيبها بتستدخدم دى .
e=[1,2,3,4,5,6,7,8,9,10]
rn.shuffle(e);print(e)
   
for i in range(10001):
    i=int(input("ENTER NUMBER ' 0 ' IF YOU WANT QUIT OR PREES ENTER :  "))
    if i== 0:break    